var calorie = 0;

document.getElementById("info").onsubmit = function () {
    //파트1. 
    var name = this.name.value;
    var age = this.age.value;
    var height = this.height.value;
    var weight = this.weight.value;
    var active = this.active.value;


    function activeindex(a) {
        if (a == '1')
            return 25;
        else if (a == '2')
            return 32.5;
        else if (a == '3')
            return 40;
    }

    var newactive = activeindex(active);
    var stdweight = (height - 100) * 0.9;
    var cal = stdweight * newactive;



    var content = ['이름 : ' + name, ' 나이 : ' + age, ' 키 : ' + height, ' 몸무게 : ' + weight, ' 활동지수 : ' + active, " 하루 권장 칼로리 : 약 " + cal + "kcal"];
    calorie = cal;
    //파트2. <p> 태그에 텍스트 추가

    var p = document.getElementById('p');
    p.textContent = "";
    for (i = 0; i < 6; i++)
        p.textContent += content[i]; // p 태그의 내용 지정하기

    //파트3. input에 쓰여있던 모든 데이터를 없애줍니다(초기화).
    this.name.value = "";
    this.age.value = "";
    this.height.value = "";
    this.weight.value = "";
    this.active.value = "";
    //파트4. 제출 이벤트로 인한 새로고침 방지


    function rand(min, max) {
        return Math.floor(Math.random() * (max - min + 1)) + min;
    }
    document.getElementById('body').innerHTML ="";

    let table = document.createElement('table');
   
    //let thead = document.createElement('thead');
    let tbody = document.createElement('tbody');

   
    //table.appendChild(thead);
    table.appendChild(tbody);

    // Adding the entire table to the body tag
    document.getElementById('body').appendChild(table);

   


    // Creating and adding data to first row of the table


    for (i = 0; i < 4; i++) {
        var daysum = [0, 0, 0, 0, 0, 0, 0];

        var heading = [];

        var row_1 = document.createElement('tr');

        heading[0] = document.createElement('th');
        heading[0].innerHTML = "구분";
        for (q = 1; q < 8; q++) {
            heading[q] = document.createElement('th');
            heading[q].innerHTML = (q + i * 7) + "일";
        }

        row_1.appendChild(heading[0]);

        for (q = 1; q < 8; q++) {
            row_1.appendChild(heading[q]);
        }
        tbody.appendChild(row_1);

        for (j = 0; j < 3; j++) {
            // Creating and adding data to second row of the table
            var row_2_data = [];
            var ran = [];
            var cal = [];
            var sum = [0, 0, 0, 0, 0, 0, 0];


            var row_2 = document.createElement('tr');

            row_2_data[0] = document.createElement('td');
            if (j == 0)
                row_2_data[0].innerHTML = "아침";
            else if (j == 1)
                row_2_data[0].innerHTML = "점심";
            else if (j == 2)
                row_2_data[0].innerHTML = "저녁";

            for (var k = 1; k <= 7; k++) {
                row_2_data[k] = document.createElement('td');

                if (j == 0) {
                    ran[k - 1] = rand(0, 9);
                    cal[k - 1] = parseInt(breakfast[ran[k - 1]].칼로리);
                    sum[k - 1] += cal[k - 1];

                    row_2_data[k].innerHTML = breakfast[ran[k - 1]].음식명 + " " + breakfast[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";

                    if (ran[k - 1] == 0 || ran[k - 1] == 1 || ran[k - 1] == 2) {
                        ran[k - 1] = rand(0, 6);
                        cal[k - 1] = parseInt(korea_2[ran[k - 1]].칼로리);
                        sum[k - 1] += cal[k - 1];
                        row_2_data[k].innerHTML += "<br>" + korea_2[ran[k - 1]].음식명 + " " + korea_2[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";
                    }
                }
                else if (j == 1 || j == 2) {
                    ran[k - 1] = rand(0, 66);
                    cal[k - 1] = parseInt(mainmenu[ran[k - 1]].칼로리);
                    sum[k - 1] += cal[k - 1];

                    row_2_data[k].innerHTML = mainmenu[ran[k - 1]].음식명 + " " + mainmenu[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";

                    if (ran[k - 1] == 0 || ran[k - 1] == 1 || ran[k - 1] == 2) {
                        ran[k - 1] = rand(0, 6);
                        cal[k - 1] = parseInt(korea_2[ran[k - 1]].칼로리);
                        sum[k - 1] += cal[k - 1];
                        row_2_data[k].innerHTML += "<br>" + korea_2[ran[k - 1]].음식명 + " " + korea_2[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";
                    }
                }



                if (j == 0 || j == 1) {
                    ran[k - 1] = rand(0, 5);
                    cal[k - 1] = parseInt(fruit[ran[k - 1]].칼로리);
                    sum[k - 1] += cal[k - 1];
                    row_2_data[k].innerHTML += "<br>" + fruit[ran[k - 1]].음식명 + " " + fruit[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";
                }
                else if (j == 2) {
                    ran[k - 1] = rand(0, 6);
                    cal[k - 1] = parseInt(drink[ran[k - 1]].칼로리);
                    sum[k - 1] += cal[k - 1];
                    row_2_data[k].innerHTML += "<br>" + drink[ran[k - 1]].음식명 + " " + drink[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";
                }

                row_2_data[k].innerHTML += "<br><br>총 " + sum[k - 1] + "kcal";
                daysum[k - 1] += sum[k - 1];

            }


            row_2.appendChild(row_2_data[0]);
            for (var k = 1; k <= 7; k++) {
                row_2.appendChild(row_2_data[k]);
            }
            tbody.appendChild(row_2);

        }


        for (var k = 1; k <= 7; k++) {
            if (calorie < daysum[k - 1]) {
                for (s = 0; s < 5; s++) {
                    var sum = [0, 0, 0, 0, 0, 0, 0];
                    ran[k - 1] = rand(0, 4);
                    cal[k - 1] = parseInt(vegetable[ran[k - 1]].칼로리);
                    sum[k - 1] += cal[k - 1];

                    row_2_data[k].innerHTML = vegetable[ran[k - 1]].음식명 + " " + vegetable[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";

                    ran[k - 1] = rand(0, 2);
                    cal[k - 1] = parseInt(nuts[ran[k - 1]].칼로리);
                    sum[k - 1] += cal[k - 1];

                    row_2_data[k].innerHTML += "<br>" + nuts[ran[k - 1]].음식명 + " " + vegetable[ran[k - 1]].단위 + "<br>" + cal[k - 1] + "kcal";

                    row_2_data[k].innerHTML += "<br><br>총 " + sum[k - 1] + "kcal";

                }

            }


        }



    }

    return false;
}



var mainmenu = [{ "종류": "한식", "음식명": "쌀밥", "단위": "1공기(200g)", "칼로리": 310 },
{ "종류": "한식", "음식명": "현미밥", "단위": "1공기(200g)", "칼로리": 321 },
{ "종류": "한식", "음식명": "잡곡밥", "단위": "1공기(200g)", "칼로리": 292 },
{ "종류": "한식", "음식명": "김치찌개", "단위": "1인분(200g)", "칼로리": 121 },
{ "종류": "한식", "음식명": "된장찌개", "단위": "1인분(200g)", "칼로리": 176 },
{ "종류": "한식", "음식명": "돈까스", "단위": "1인분(200g)", "칼로리": 568 },
{ "종류": "한식", "음식명": "치즈돈까스", "단위": "1인분(250g)", "칼로리": 721 },
{ "종류": "한식", "음식명": "부대찌개", "단위": "1인분(200g)", "칼로리": 290 },
{ "종류": "한식", "음식명": "콩나물국", "단위": "1인분(200g)", "칼로리": 16 },
{ "종류": "한식", "음식명": "등갈비찜", "단위": "1인분(400g)", "칼로리": 852 },
{ "종류": "한식", "음식명": "불고기", "단위": "1인분(200g)", "칼로리": 371 },
{ "종류": "한식", "음식명": "갈비탕", "단위": "1인분(400g)", "칼로리": 466 },
{ "종류": "한식", "음식명": "삼계탕", "단위": "1인분(1000g)", "칼로리": 918 },
{ "종류": "한식", "음식명": "바지락칼국수", "단위": "1인분(350g)", "칼로리": 450 },
{ "종류": "한식", "음식명": "물냉면", "단위": "1인분(300g)", "칼로리": 286 },
{ "종류": "한식", "음식명": "비빔냉면", "단위": "1인분(300g)", "칼로리": 347 },
{ "종류": "한식", "음식명": "떡만둣국", "단위": "1인분(300g)", "칼로리": 442 },
{ "종류": "한식", "음식명": "쭈꾸미볶음", "단위": "1인분(300g)", "칼로리": 578 },
{ "종류": "한식", "음식명": "김치볶음밥", "단위": "1인분(300g)", "칼로리": 446 },
{ "종류": "한식", "음식명": "라면", "단위": "1봉(120g)", "칼로리": 500 },
{ "종류": "한식", "음식명": "김밥", "단위": "1줄(200g)", "칼로리": 318 },
{ "종류": "한식", "음식명": "참치김밥", "단위": "1줄(250g)", "칼로리": 418 },
{ "종류": "한식", "음식명": "삼겹살", "단위": "1인분(200g)", "칼로리": 920 },
{ "종류": "한식", "음식명": "떡볶이", "단위": "1인분(200g)", "칼로리": 303 },
{ "종류": "한식", "음식명": "육개장", "단위": "1인분(200g)", "칼로리": 165 },
{ "종류": "한식", "음식명": "돼지고기김치찜", "단위": "1인분(200g)", "칼로리": 389 },
{ "종류": "한식", "음식명": "족발", "단위": "1인분(300g)", "칼로리": 788 },
{ "종류": "한식", "음식명": "보쌈", "단위": "1인분(300g)", "칼로리": 781 },
{ "종류": "한식", "음식명": "순댓국", "단위": "1인분(800g)", "칼로리": 540 },
{ "종류": "한식", "음식명": "닭볶음탕", "단위": "1인분(300g)", "칼로리": 460 },
{ "종류": "한식", "음식명": "찜닭", "단위": "1인분(300g)", "칼로리": 525 },
{ "종류": "한식", "음식명": "해물파전", "단위": "1인분(150g)", "칼로리": 240 },
{ "종류": "한식", "음식명": "육전", "단위": "1인분(150g)", "칼로리": 292 },
{ "종류": "한식", "음식명": "곱창", "단위": "1인분(150g)", "칼로리": 265 },
{ "종류": "한식", "음식명": "막창", "단위": "1인분(200g)", "칼로리": 601 },
{ "종류": "일식", "음식명": "메밀국수", "단위": "1인분(350g)", "칼로리": 221 },
{ "종류": "일식", "음식명": "회덮밥", "단위": "1인분(400g)", "칼로리": 546 },
{ "종류": "일식", "음식명": "우동", "단위": "1인분(200g)", "칼로리": 168 },
{ "종류": "일식", "음식명": "부타동", "단위": "1인분(400g)", "칼로리": 662 },
{ "종류": "일식", "음식명": "야끼우동", "단위": "1인분(310g)", "칼로리": 564 },
{ "종류": "일식", "음식명": "스키야키", "단위": "1인분(600g)", "칼로리": 660 },
{ "종류": "일식", "음식명": "샤브샤브", "단위": "1인분(400g)", "칼로리": 768 },
{ "종류": "일식", "음식명": "카레라이스", "단위": "1인분(400g)", "칼로리": 537 },
{ "종류": "일식", "음식명": "연어초밥", "단위": "1개(40g)", "칼로리": 66 },
{ "종류": "일식", "음식명": "유부초밥", "단위": "1개(50g)", "칼로리": 90 },
{ "종류": "양식", "음식명": "함박스테이크", "단위": "1인분(200g)", "칼로리": 479 },
{ "종류": "양식", "음식명": "오므라이스", "단위": "1인분(400g)", "칼로리": 380 },
{ "종류": "양식", "음식명": "토마토 스파케티", "단위": "1인분(300g)", "칼로리": 422 },
{ "종류": "양식", "음식명": "까르보나라", "단위": "1인분(350g)", "칼로리": 670 },
{ "종류": "양식", "음식명": "오일 파스타", "단위": "1인분(300g)", "칼로리": 485 },
{ "종류": "양식", "음식명": "피자", "단위": "1조각(150g)", "칼로리": 404 },
{ "종류": "양식", "음식명": "치킨", "단위": "1조각(100g)", "칼로리": 250 },
{ "종류": "양식", "음식명": "양념치킨", "단위": "1조각(100g)", "칼로리": 323 },
{ "종류": "양식", "음식명": "햄치즈 샌드위치", "단위": "1개(150g)", "칼로리": 352 },
{ "종류": "양식", "음식명": "참치 샌드위치", "단위": "1개(150g)", "칼로리": 355 },
{ "종류": "양식", "음식명": "햄버거", "단위": "1개(100g)", "칼로리": 253 },
{ "종류": "양식", "음식명": "콘치즈버터", "단위": "1인분(170g)", "칼로리": 758 },
{ "종류": "양식", "음식명": "감자튀김", "단위": "1인분(100g)", "칼로리": 306 },
{ "종류": "중식", "음식명": "짜장면", "단위": "1인분(400g)", "칼로리": 728 },
{ "종류": "중식", "음식명": "짬뽕", "단위": "1인분(800g)", "칼로리": 464 },
{ "종류": "중식", "음식명": "볶음밥", "단위": "1인분(300g)", "칼로리": 504 },
{ "종류": "중식", "음식명": "탕수육", "단위": "1회(100g)", "칼로리": 228 },
{ "종류": "중식", "음식명": "군만두", "단위": "1개(30g)", "칼로리": 77 },
{ "종류": "중식", "음식명": "멘보샤", "단위": "1인분(30g)", "칼로리": 74 },
{ "종류": "중식", "음식명": "마파두부", "단위": "1인분(250g)", "칼로리": 301 },
{ "종류": "중식", "음식명": "깐풍기", "단위": "1인분(300g)", "칼로리": 610 },
{ "종류": "중식", "음식명": "잡채밥", "단위": "1인분(400g)", "칼로리": 620 }]

var breakfast = [{ "종류": "한식", "음식명": "쌀밥", "단위": "1공기(200g)", "칼로리": 310 },
{ "종류": "한식", "음식명": "현미밥", "단위": "1공기(200g)", "칼로리": 321 },
{ "종류": "한식", "음식명": "잡곡밥", "단위": "1공기(200g)", "칼로리": 292 },
{ "종류": "한식", "음식명": "콩나물국", "단위": "1인분(200g)", "칼로리": 16 },
{ "종류": "양식", "음식명": "햄치즈 샌드위치", "단위": "1개(150g)", "칼로리": 352 },
{ "종류": "양식", "음식명": "참치 샌드위치", "단위": "1개(150g)", "칼로리": 355 },
{ "종류": "일식", "음식명": "유부초밥", "단위": "1개(50g)", "칼로리": 90 },
{ "종류": "한식", "음식명": "김밥", "단위": "1줄(200g)", "칼로리": 318 },
{ "종류": "한식", "음식명": "김치찌개", "단위": "1인분(200g)", "칼로리": 121 },
{ "종류": "한식", "음식명": "된장찌개", "단위": "1인분(200g)", "칼로리": 176 }]

var korea_2 = [{ "종류": "한식(밑반찬)", "음식명": "장조림", "단위": "1인분(60g)", "칼로리": 89 },
{ "종류": "한식(밑반찬)", "음식명": "감자채볶음", "단위": "1접시(130g)", "칼로리": 85 },
{ "종류": "한식(밑반찬)", "음식명": "배추김치", "단위": "1접시(100g)", "칼로리": 25 },
{ "종류": "한식(밑반찬)", "음식명": "멸치볶음", "단위": "1접시(40g)", "칼로리": 136 },
{ "종류": "한식(밑반찬)", "음식명": "잡채", "단위": "1인분(100g)", "칼로리": 258 },
{ "종류": "한식(밑반찬)", "음식명": "계란프라이", "단위": "1개(46g)", "칼로리": 90 },
{ "종류": "한식(밑반찬)", "음식명": "삶은 달걀", "단위": "1개(50g)", "칼로리": 68 }]

var snack = [{ "종류": "간식", "음식명": "생크림케이크", "단위": "1조각(80g)", "칼로리": 210 },
{ "종류": "간식", "음식명": "초콜릿케이크", "단위": "1조각(80g)", "칼로리": 250 },
{ "종류": "간식", "음식명": "도넛", "단위": "1개(47g)", "칼로리": 201 },
{ "종류": "간식", "음식명": "카스텔라", "단위": "1개(70g)", "칼로리": 235 },
{ "종류": "간식", "음식명": "군고구마", "단위": "1회(100g)", "칼로리": 124 },
{ "종류": "간식", "음식명": "식빵", "단위": "1쪽(40g)", "칼로리": 111 }]

var fruit = [{ "종류": "과일", "음식명": "사과", "단위": "1회(100g)", "칼로리": 57 },
{ "종류": "과일", "음식명": "바나나", "단위": "1개(100g)", "칼로리": 93 },
{ "종류": "과일", "음식명": "딸기", "단위": "1회(100g)", "칼로리": 27 },
{ "종류": "과일", "음식명": "아보카도", "단위": "1인분(100g)", "칼로리": 187 },
{ "종류": "과일", "음식명": "배", "단위": "1회(100g)", "칼로리": 48 },
{ "종류": "과일", "음식명": "키위", "단위": "1개(100g)", "칼로리": 54 }]

var vegetable = [{ "종류": "채소", "음식명": "토마토", "단위": "1개(100g)", "칼로리": 14 },
{ "종류": "채소", "음식명": "방울토마토", "단위": "1개(13g)", "칼로리": 2 },
{ "종류": "채소", "음식명": "양배추", "단위": "1회(100g)", "칼로리": 24 },
{ "종류": "채소", "음식명": "오이", "단위": "1개(210g)", "칼로리": 19 },
{ "종류": "채소", "음식명": "야채샐러드", "단위": "1인분(150g)", "칼로리": 100 }]

var nuts = [{ "종류": "견과류", "음식명": "건포도", "단위": "1회분(100g)", "칼로리": 274 },
{ "종류": "견과류", "음식명": "아몬드", "단위": "1개(1g)", "칼로리": 7 },
{ "종류": "견과류", "음식명": "땅콩", "단위": "1회(20g)", "칼로리": 113 }]

var diet = [{ "종류": "다이어트", "음식명": "닭가슴살", "단위": "1인분(100g)", "칼로리": 107 }]

var drink = [{ "종류": "음료", "음식명": "아메리카노", "단위": "1잔(240ml)", "칼로리": 4 },
{ "종류": "음료", "음식명": "카페라떼", "단위": "1잔(240ml)", "칼로리": 180 },
{ "종류": "음료", "음식명": "우유", "단위": "1컵(100ml)", "칼로리": 65 },
{ "종류": "음료", "음식명": "콜라", "단위": "1캔(250ml)", "칼로리": 108 },
{ "종류": "음료", "음식명": "사이다", "단위": "1캔(250ml)", "칼로리": 110 },
{ "종류": "음료", "음식명": "이온음료", "단위": "1캔(250ml)", "칼로리": 50 },
{ "종류": "음료", "음식명": "요쿠르트", "단위": "1개(65ml)", "칼로리": 35 }]

